In [1]:
import pandas as pd

In [2]:
simple_df = pd.DataFrame({'name': ["ali", "reza"], "age": [21, 32]})
simple_df

   name  age
0   ali   21
1  reza   32

In [7]:
simple_df = pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})
simple_df

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [22]:
print('the type of simple_df', type(simple_df))

the type of simple_df <class 'pandas.core.frame.DataFrame'>

In [8]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [12]:
students = pd.DataFrame([["Ali", "Ghaderi Pour", 33, 171, "male", "Qualified"], ["Mahmood", "Gishin Zadeh", 37, 160, "male", "Not Qualified"],
                         ["Ahad", "Safizadeh", 37, 181, "male", "Qualified"], ["Zahra", "Karimi", 44, 156, "female", "Not Qualified"]],
                        columns=["First "
                                 "Name",
                                 "Last "
                                 "Name",
                                 "Age",
                                 "Height",
                                 "Sex",
                                 "Status"], index=[1, 2, 3, 4])
students

  First Name     Last Name  Age  Height     Sex         Status
1        Ali  Ghaderi Pour   33     171    male      Qualified
2    Mahmood  Gishin Zadeh   37     160    male  Not Qualified
3       Ahad     Safizadeh   37     181    male      Qualified
4      Zahra        Karimi   44     156  female  Not Qualified

In [16]:
student_age = pd.Series([12, 25, 35, 13], index=[1, 2, 3, 4], name='Student Age')
student_age

1    12
2    25
3    35
4    13
Name: Student Age, dtype: int64

In [10]:
animals = pd.DataFrame({'Cows': [12, 20], 'Goats': [22, 19]}, index=['Year 1', 'Year 2'])
animals

        Cows  Goats
Year 1    12     22
Year 2    20     19

In [11]:
df = pd.DataFrame(animals)
df.to_csv('cows_and_goats.csv')
cows_and_goats = pd.read_csv('cows_and_goats.csv')
cows_and_goats

  Unnamed: 0  Cows  Goats
0     Year 1    12     22
1     Year 2    20     19

In [12]:

animals.to_csv('cows_and_goats.csv')
cows_and_goats = pd.read_csv('cows_and_goats.csv')
cows_and_goats

  Unnamed: 0  Cows  Goats
0     Year 1    12     22
1     Year 2    20     19